tuning_wdr/log/benchmark_log/1699273403.log
[2023-11-06 20:23:40,734:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            462
        write:                           132
        other:                           66
        total:                           660
    transactions:                        33     (2.46 per sec.)
    queries:                             660    (49.26 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          13.3967s
    total number of events:              33

Latency (ms):
         min:                                 4947.44
         avg:                                10697.31
         max:                                13395.80
         95th percentile:                    13308.98
         sum:                               353011.11

Threads fairness:
    events (avg/stddev):           1.0312/0.17
    execution time (avg/stddev):   11.0316/2.33


[2023-11-06 20:24:56,820:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            518
        write:                           148
        other:                           74
        total:                           740
    transactions:                        37     (3.18 per sec.)
    queries:                             740    (63.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          11.6251s
    total number of events:              37

Latency (ms):
         min:                                 3020.89
         avg:                                 8010.18
         max:                                11621.55
         95th percentile:                    11115.87
         sum:                               296376.58

Threads fairness:
    events (avg/stddev):           1.1562/0.36
    execution time (avg/stddev):   9.2618/1.84


[2023-11-06 20:25:11,735:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            574
        write:                           164
        other:                           82
        total:                           820
    transactions:                        41     (3.87 per sec.)
    queries:                             820    (77.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.5990s
    total number of events:              41

Latency (ms):
         min:                                 2391.09
         avg:                                 6578.09
         max:                                10202.50
         95th percentile:                     9624.59
         sum:                               269701.81

Threads fairness:
    events (avg/stddev):           1.2812/0.45
    execution time (avg/stddev):   8.4282/1.62