tuning_wdr/log/benchmark_log/1699520078.log
[2023-11-09 16:55:05,831:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.37 per sec.)
    queries:                             640    (27.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          23.3802s
    total number of events:              32

Latency (ms):
         min:                                16694.69
         avg:                                21479.80
         max:                                23377.07
         95th percentile:                    23257.82
         sum:                               687353.46

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   21.4798/1.67


[2023-11-09 16:56:31,255:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.48 per sec.)
    queries:                             640    (29.66 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.5760s
    total number of events:              32

Latency (ms):
         min:                                 8486.72
         avg:                                18556.08
         max:                                21573.55
         95th percentile:                    21641.55
         sum:                               593794.48

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   18.5561/3.20


[2023-11-09 16:56:51,584:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.95 per sec.)
    queries:                             640    (38.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          16.4363s
    total number of events:              32

Latency (ms):
         min:                                 7115.76
         avg:                                14563.73
         max:                                16432.55
         95th percentile:                    16224.31
         sum:                               466039.43

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   14.5637/1.91