tuning_wdr/log/benchmark_log/1699520347.log
[2023-11-09 16:59:24,480:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (2.35 per sec.)
    queries:                             640    (46.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          13.6270s
    total number of events:              32

Latency (ms):
         min:                                 6597.17
         avg:                                11489.72
         max:                                13623.48
         95th percentile:                    13550.80
         sum:                               367671.13

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   11.4897/1.97


[2023-11-09 17:00:41,846:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            462
        write:                           132
        other:                           66
        total:                           660
    transactions:                        33     (2.47 per sec.)
    queries:                             660    (49.43 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          13.3482s
    total number of events:              33

Latency (ms):
         min:                                 3714.67
         avg:                                11300.25
         max:                                13148.78
         95th percentile:                    13071.47
         sum:                               372908.41

Threads fairness:
    events (avg/stddev):           1.0312/0.17
    execution time (avg/stddev):   11.6534/1.69


[2023-11-09 17:00:57,429:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            462
        write:                           132
        other:                           66
        total:                           660
    transactions:                        33     (2.95 per sec.)
    queries:                             660    (59.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          11.1699s
    total number of events:              33

Latency (ms):
         min:                                 3788.27
         avg:                                 9107.71
         max:                                11166.06
         95th percentile:                    11115.87
         sum:                               300554.34

Threads fairness:
    events (avg/stddev):           1.0312/0.17
    execution time (avg/stddev):   9.3923/1.37