tuning_wdr/log/benchmark_log/1699524864.log
[2023-11-09 18:14:57,799:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.57 per sec.)
    queries:                             640    (31.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          19.9167s
    total number of events:              32

Latency (ms):
         min:                                18501.13
         avg:                                18722.52
         max:                                19915.28
         95th percentile:                    19078.64
         sum:                               599120.56

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   18.7225/0.27


[2023-11-09 18:16:15,958:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            490
        write:                           140
        other:                           70
        total:                           700
    transactions:                        35     (2.77 per sec.)
    queries:                             700    (55.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          12.6183s
    total number of events:              35

Latency (ms):
         min:                                 3401.94
         avg:                                 9201.12
         max:                                12443.73
         95th percentile:                    12163.09
         sum:                               322039.11

Threads fairness:
    events (avg/stddev):           1.0938/0.29
    execution time (avg/stddev):   10.0637/1.61


[2023-11-09 18:16:32,480:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            462
        write:                           132
        other:                           66
        total:                           660
    transactions:                        33     (3.38 per sec.)
    queries:                             660    (67.56 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          9.7635s
    total number of events:              33

Latency (ms):
         min:                                 3177.11
         avg:                                 7213.88
         max:                                 9759.41
         95th percentile:                     9118.47
         sum:                               238057.90

Threads fairness:
    events (avg/stddev):           1.0312/0.17
    execution time (avg/stddev):   7.4393/1.29